{ "Products":
    [
        {
            "ProductToken": "",
            "BrandName": "AirlineGift",
            "Country": "Australia",
            "CountryCode": "AU",
            "Discount": "",
            "Denominations": "",
            "Currency": "USD",
            "RealTimeStock": "",
            "Categories": "Tourism",
            "LanguageCode": "en-EN",
            "BrandDescription": "AirlineGift offers the world’s best airlines gift card and online travel booking selection with a unique choice of 450 Airlines to book a flight to almost anywhere in the world. AirlineGift offers travel brands such as Delta Airlines, American Airlines, United Airlines, British Airways, Qantas, Air France, KLM, Southwest Airlines, Air Canada, Emirates, Etihad, Cathay Pacific, Singapore Airlines and hundreds of other trusted travel partners. AirlineGift provides a unique feature of online split payments allowing you to use two payment cards to complete your purchase transaction with instant bonus travel rewards.&quot;, &quot;Redemption Instructions  Please read info below for instructions on how to redeem your Gift card. Redeem (use) Online Only at: http://airlinegift.com 1) Register an Account at http://airlinegift.com then click on Book Trip | Redeem 2) Search, Book or purchase based on your product needs. 3) Once you have selected the options that best suit your needs, enter the details of the person or all persons involved in the booking or product transaction 4) Proceed to the check-out page and copy and paste your eGift card code into the Redeem eGift card code box and click submit, proceed to agree to the T&amp;Cs and click Order now to complete your booking &amp; transaction, you will shortly receive a confirmation via email. 5) A maximum of 2 eGift card codes are permitted per transaction, if your basket value exceeds the value of the eGift cards you may pay the difference by using Visa, MasterCard or American Express. 6) AirlineGift gift cards have a 12 months expiration from issuance, except for residents in North America gift cards do not expire. Ireland expiration is 60 months and Australia &amp; Germany which is 36 months, subject to local State &amp; Country law and any required residual refund value for each State &amp; Country, for full terms and conditions on currency and country of residence redemption requirements please visit http://tripgift.com/info/terms-and-conditions.aspx 7) All website content, customer service, tickets and eVouchers will be in English language. Gift cards &amp; eVouchers cannot be exchanged or refunded. 8) For quick answers and any questions regarding Gift cards and best use, please visit https://faqs.tripgift.com/ 9) For processing and compliance reasons please allow a minimum five (5) days lead time from today to make any travel bookings on the website. For this reason same day bookings cannot be supported as the lead time for Bookings and check-in is 5 days. 10) All gift cards are non-refundable, Gift cards cannot be exchanged or resold to other recipients, please see our terms and conditions of sale",
            "RedemptionInstructions": "",
            "LogoFile": "https://data.huuray.com/Store_4562/Logo/133034876856445740.png"
        },
        {
            "ProductToken": "",
            "BrandName": "Amart Furniture",
            "Country": "Australia",
            "CountryCode": "AU",
            "Discount": "",
            "Denominations": "",
            "Currency": "USD",
            "RealTimeStock": "",
            "Categories": "Furniture",
            "LanguageCode": "",
            "BrandDescription": "Gift Cards are issued by Amart Furniture Pty Limited ABN 65 009 810 324 (Amart Furniture) and are redeemable for goods and/or services from any Amart Furniture store in Australia or online at http://www.amartfurniture.com.au.  All purchasers of Gift Cards agree to these Terms at the time of purchase of a Gift Card. Gift Card holders agree to these Terms when redeeming or attempting to redeem a Gift Card. Gift Cards have no value until they are activated in Amart Furniture's Gift Card system (System). After activation, Gift Card holders are responsible for the use and safety of the Gift Card. Gift Cards expire 36 months from date of issue (Expiry Date)and will not be reissued on expiry. Any balance remaining on a Gift Card will not be redeemable after the Expiry Date. On presentation of a Gift Card, Amart Furniture will provide credit up to the value of the Gift Card validated on the System, against the purchase price of products purchased from Amart Furniture. If the purchase price exceeds the validated value of the Gift Card, the Gift Card Holder must pay the difference using another acceptable payment method. No change will be given and any balance of the Gift Card may only be used in whole or part against future purchases from Amart Furniture. Details of the Gift Card balance, transaction history and expiry date contained within the System are conclusive evidence of those details. Gift Cards: may be purchased as five (5) cards per transaction; may not be used to purchase further Gift Cards; will be void once the value or balance of the Gift Card has been fully redeemed; do not allow for cash advances and are not redeemable for cash; will be issued without alteration and will be immediately void if altered or defaced; must be treated as cash and will not be reissued, refunded or honoured if lost or stolen; will not be reissued, refunded or honoured if found to be faulty or damaged unless the Gift Card is proven to be faulty or damaged due to the fault of Amart Furniture; Gift Card bearers may be required to provide satisfactory proof of identity. Amart Furniture may collect personal information subject to its Privacy Policy. Amart Furniture's Privacy Policy is available at https://www.amartfurniture.com.au/customer-care/privacy/. Persons subject to these Terms consent to the use of the personal information in accordance with the Privacy Policy unless they advise otherwise. Amart Furniture reserves the right to amend these Terms at any time without notice. To the extent permitted by law, Amart Furniture is not liable to any person for any loss or damage (including direct or consequential loss), nor will it be in default of these Terms for failure to observe or perform any of their obligations under these Terms, for any reason or cause, which could not, with reasonable diligence, be controlled or prevented. These Terms are governed by and construed in accordance with the laws of Queensland, Australia and the non-exclusive jurisdiction of the courts of Queensland will apply where there is any dispute. Any complaints or enquiries about any goods or services purchased with a Gift Card may be resolved with Amart Furniture store where the goods or services were purchased. - https://www.amartfurniture.com.au/gift-card",
            "RedemptionInstructions": "",
            "LogoFile": "https://data.huuray.com/Store_3711/Logo/132907776137702795.jpg"
        },
        {
            "ProductToken": "",
            "BrandName": "Audio Books Gift Card",
            "Country": "Belgium",
            "CountryCode": "BE",
            "Discount": "",
            "Denominations": "",
            "Currency": "EUR",
            "RealTimeStock": "",
            "Categories": "Audio & TV",
            "LanguageCode": "",
            "BrandDescription": "Get your game on with top PC and MAC games from leading publishers including Ubisoft, Atari &amp; Bethesda. Grab yourself a bargain from the Special Offers section with massive discounts of up to 75%, updated daily. - - Visit reward the world™ (https://www.rewardtheworld.com/) to browse the full catalog.&quot;, &quot;*&nbsp;Must be 13+ years of age &nbsp;*&nbsp;Requires an account at Reward the World™ and internet access to redeem &nbsp;*&nbsp;Usable for purchases of eligible items up to the value of the gift card at Reward the World™ only. &nbsp;*&nbsp;Other limits may apply. Except as required by law, card is not redeemable for cash or other cards, not reloadable or refundable, cannot be combined with other non-Reward the World™ balances, resold, exchanged or transferred for value &nbsp;*&nbsp;Gift cards/vouchers are valid for a limited period only as is specified by the expiry date &nbsp;*&nbsp;User responsible for loss of card. &nbsp;*&nbsp;For assistance visit https://www.rewardtheworld.com/en/faq/general or contact support https://www.rewardtheworld.com/en/support. Issued by RTW Digital Ltd.",
            "RedemptionInstructions": "",
            "LogoFile": "https://data.huuray.com/Store_4470/Logo/132948286051450105.png"
        },
        {
            "ProductToken": "",
            "BrandName": "Avior Hotel",
            "Country": "Philippines",
            "CountryCode": "PH",
            "Discount": "",
            "Denominations": "",
            "Currency": "USD",
            "RealTimeStock": "",
            "Categories": "Tourism",
            "LanguageCode": "",
            "BrandDescription": "For over forty years, Avis has been providing travelers and commuters a safe passage in the streets of Manila and the rest of the Philippines. Offering airport transfers, private car rentals, and chauffeur services, have a safe and enjoyable trip with Avis every time.&quot;, &quot;How to Redeem/Use Print or copy the eGift code You will need to present the code to the manager upon using it at our location. Present code and enjoy! Present the code to the manager for validation – enjoy your gift! Terms and conditions Each eGift has a unique code that corresponds to an amount or item. To use the eGift at the store, the code must be given by the recipient to the store staff for validation.The recipient must wait for the store staff to finish the validation process. The store staff will receive a validation response indicating the eGift amount and validity. The store staff will follow only what is indicated in the validation response.The recipient is responsible for the safekeeping of the eGift code. The recipient must only give this to the store staff once he/she commits to use it at the store.In the event that the store’s eGift validation system is offline or unavailable, the store staff shall politely decline to accept the eGift. The recipient may still use the eGift when the system is back online.The eGift may not be valid for use on certain promotional items/services and it cannot be exchanged for cash.The eGift is for one-time use only. If the total value of eGift is not used up, there will be no cash change given. If the purchase goes beyond the eGift amount, the recipient is to pay for the difference.*Multiple eGift codes may be used per transaction.",
            "RedemptionInstructions": "",
            "LogoFile": "https://data.huuray.com/Store_4027/Logo/132908589304229703.jpg"
        },
        {
            "ProductToken": "",
            "BrandName": "HotelsGift",
            "Country": "South Africa",
            "CountryCode": "ZA",
            "Discount": "",
            "Denominations": "",
            "Currency": "USD",
            "RealTimeStock": "",
            "Categories": "",
            "LanguageCode": "",
            "BrandDescription": "HotelsGift offers the world’s best Hotel gift card with over 750,000 Hotels, Villas &amp; Apartments to book with one gift card. HotelsGift offers travel brands such as Marriott, Hyatt, Hilton, Wyndham, Fairmont, Accor, IHG and Thousands of other trusted travel partners. HotelsGift provides a unique feature of online split payments allowing you to use two payment cards to complete your purchase transaction with bonus travel rewards.&quot;, &quot;Redemption Instructions. Please read info below for instructions on how to redeem your Gift card. Redeem (use) Online Only at: http://hotelsgiftcard.com    1) Register an Account at http://hotelsgiftcard.com then click on Book Trip | Redeem  2) Search, Book or purchase based on your product needs.  3) Once you have selected the options that best suit your needs, enter the details of the person or all persons involved in the booking or product transaction  4) Proceed to the check-out page and copy and paste your eGift card code into the Redeem eGift card code box and click submit, proceed to agree to the T&amp;Cs and click Order now to complete your booking &amp; transaction, you will shortly receive a confirmation via email.  5) A maximum of 2 eGift card codes are permitted per transaction, if your basket value exceeds the value of the eGift cards you may pay the difference by using Visa, MasterCard or American Express.  6) HotelsGift gift cards have a 12 months expiration from issuance, except for residents in North America gift cards do not expire. Ireland expiration is 60 months and Australia &amp; Germany which is 36 months, subject to local State &amp; Country law and any required residual refund value for each State &amp; Country, for full terms and conditions on currency and country of residence redemption requirements please visit http://tripgift.com/info/terms-and-conditions.aspx  7) All website content, customer service, tickets and eVouchers will be in English language. Gift cards &amp; eVouchers cannot be exchanged or refunded.  8) For quick answers and any questions regarding Gift cards and best use, please visit https://faqs.tripgift.com/  9) For processing and compliance reasons please allow a minimum five (5) days lead time from today to make any travel bookings on the website. For this reason same day bookings cannot be supported as the lead time for Bookings and check-in is 5 days.  10) All gift cards are non-refundable, Gift cards cannot be exchanged or resold to other recipients, please see our terms and conditions of sale.",
            "RedemptionInstructions": "",
            "LogoFile": "https://data.huuray.com/Store_4564/Logo/133034879962755339.png"
        }
    ],
    "Status": "200",
    "Message" : "It's OK"
}